#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: How to run this project
#+date: <2019-08-24 土>
#+author: meguru
#+email: meguru.mokke@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.2 (Org mode 9.2.4)
* Tensorflow with Org-mode
  
  1. install some python package for complementation and syntax checking
     #+CAPTION: Your terminal in which the virtualenv is activated 
     #+BEGIN_SRC shell
     pip install jedi rope autopep8 yapf black flake8 jupyter tqdm
     #+END_SRC

  2. activation virtualenv in your emacs ~M-x pyvenv-activate [RET] <your virtualenv path>~

  3. generate jupyter settings

      #+CAPTION: Your terminal in which the virtualenv is activated 
     #+BEGIN_SRC shell
      jupyter notebook --generate-config
      jupyter notebook password
     #+END_SRC

  4. run below code your org file
     
     In *src block*, *C-c C-c* sis evaluate block
#+NAME: d8fc8392-fdb7-44ab-9d6b-a618e7a5db55
#+BEGIN_SRC ein-python :session localhost :results raw  drawer :exports both
import tensorflow as tf
tf.add(1, 2)
#+END_SRC

#+RESULTS: d8fc8392-fdb7-44ab-9d6b-a618e7a5db55
:RESULTS:
<tf.Tensor: id=22, shape=(), dtype=int32, numpy=3>
:END:

